---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.IDuctFittingAndAccessoryPressureDropServer.GetDataSchema
source: html/f7f4eb89-44d4-adef-99f5-4220c310eed6.htm
---
# Autodesk.Revit.DB.Mechanical.IDuctFittingAndAccessoryPressureDropServer.GetDataSchema Method

Obtains the schema of the ESEntity.

## Syntax (C#)
```csharp
Schema GetDataSchema()
```

## Returns
Null if the server has no data.